<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
  <title>JonDo-Hilfe: JonDoFox</title>
  <link rel="stylesheet" type="text/css" href="Other/xhelpfrms.css">
</head>

<body>

<h2>JonDoFox - Sicherheit und Privatsph&#xe4;re f&#xfc;r Firefox</h2>

<p>JonDoFox ist ein <a
href="http://www.mozilla-europe.org/de/firefox/">Firefox</a>-Browserprofil
(Browserkonfiguration), das speziell f&#xfc;r anonymes und sicheres Websurfen
optimiert ist. Sie k&#xf6;nnen JonDoFox sowohl in Ihren Firefox integrieren als
auch separat und vom USB-Stick ausf&#xfc;hren. Im Folgenden wird beschrieben,
wie Sie JonDoFox installieren und benutzen. </p>
<ul>
  <li><strong>Installationsoptionen</strong> 
    <ul>
      <li><a href="#ffprofile">Integration in Firefox</a></li>
      <li><a href="#jdfPortable">"Zum Mitnehmen", z.B. auf USB-Sticks (zur Zeit
        nur f&#xfc;r Windows)</a></li>
    </ul>
  </li>
  <li><strong>Bedienung</strong> 
    <ul>
      <li><a href="#critical_addons">Sicherheitskritische
        Firefox-Erweiterungen</a></li>
      <li><a href="#jdf_features">JonDoFox Features</a></li>
      <li><a href="#controlCookies">Cookies
        kontrollieren mit Cookie Monster</a></li>
      <li><a href="#noscript">Aktive Inhalte kontrollieren mit NoScript</a></li>
      <li><a href="#videoDownload">Schutz gegen gef&#xe4;hrliche Flash-Videos:
        Video-Download mit UnPlug und aTube Catcher</a></li>
      <li><a href="#filterAds">Werbung filtern mit
      Adblock Plus</a></li> 
    </ul>
  </li>
</ul>

<h2>Installationsoptionen f&#xfc;r JonDoFox</h2>

<h3><a name="ffprofile" id="ffprofile">Variante 1: Integration in
Firefox</a></h3>

<p>Diese Installationsoption integriert das JonDoFox-Profil in einen lokal
installierten Firefox, so dass JonDoFox nahtlos mit Ihrem System
zusammenarbeitet. Eine eventuell von Ihnen vorher angelegte "normale"
Firefox-Konfiguration wird durch die Profil-Installation nicht angetastet. Sie
k&#xf6;nnen nach der Installation bei jedem Start von Firefox zwischen Ihrer
und der JonDoFox-Konfiguration ausw&#xe4;hlen. </p>

<p>Installieren Sie zun&#xe4;chst <a
href="http://www.mozilla-europe.org/de/firefox/">Firefox</a> auf Ihrem System,
falls noch nicht geschehen. Anschlie&#xdf;end k&#xf6;nnen Sie die Installation
von JonDoFox wie folgt durchf&#xfc;hren:</p>
<ul>
  <li><strong>Windows</strong>
    <p>Laden Sie das <a
    href="https://anonymous-proxy-servers.net/downloads/JonDoFox.paf.exe">JonDoFox-Installationsprogramm</a> herunter.
    Starten Sie das heruntergeladene Programm durch einen (Doppel-)Klick und
    folgen Sie dann den Anweisungen.</p>
  </li>
  <li><strong>Mac OS X</strong>
    <ol>
      <li>Laden Sie die Datei <a
        href="https://anonymous-proxy-servers.net/de/downloads/JonDoFox_OS_X.dmg">JonDoFox_OS_X.dmg</a>
        herunter.</li>
      <li>&#xd6;ffnen Sie die Datei durch einen Doppelklick, und starten Sie
        anschlie&#xdf;end <em>JonDoFox_Install</em> ebenfalls durch einen
        Doppelklick.</li>
    </ol>
    <p><b>Hinweis</b><br>
    Der Installer kann auch verwendet werden, um das von ihm installierte
    Profil wieder zu entfernen, doch <b>beachten Sie:</b><br>
    Bitte ver&#xe4;ndern Sie die Eintr&#xe4;ge nicht, die der Installer
    vornimmt. Andernfalls kann keine saubere Deinstallation mehr
    gew&#xe4;hrleistet werden! Nehmen Sie ebenso die Deinstallation mit dem
    Installer <b>nur dann vor</b>, wenn Sie diesen auch f&#xfc;r die
    JonDoFox-Installation verwendet haben. </p>
  </li>
  <li><strong>Debian/Ubuntu</strong>
  <p>Benutzer von Debian und Ubuntu k&ouml;nnen das <a href="https://anonymous-proxy-servers.net/de/help/firststeps2.html">Software-Repository</a>
  der JonDos GmbH nutzen, um JonDoFox und JonDo zu installieren.</p></li>
  <li><strong>Andere Linuxdistributionen</b></strong>
    <ol> 
      <li>Laden Sie die Datei <a
        href="https://anonymous-proxy-servers.net/de/downloads/profile.zip">profile.zip</a>
        herunter.
      </li>
      <li>Entpacken Sie die Datei: <kbd>&gt; unzip profile.zip -d Zielordner</kbd>
     </li>
      <li>Wechseln Sie in das Verzeichnis, in das Sie die Zip-Datei entpackt
        haben. <kbd>&gt; cd Zielordner</kbd>
      </li>
      <li>Sie finden in diesem Ordner das Skript <code>install_linux.sh</code>.
        F&#xfc;hren Sie es aus, um JonDoFox zu installieren. <kbd>user@computer#:/target&gt; ./install_linux.sh</kbd>
      </li>
    </ol>
  </li> 
</ul>

<p><b>Hinweis</b><br>
Wenn eine neue Version von JonDoFox erscheint, k&#xf6;nnen Sie die neue Version
jeweils "&#xfc;ber" die alte installieren, mit den gleichen eben besprochenen Schritten. Ihre
Lesezeichen und die Zertifikatsdatenbank bleiben dabei erhalten. </p>

<h3><a name="jdfPortable" id="jdfPortable">Variante 2: "zum Mitnehmen"</a></h3>

<p>Die Version "zum Mitnehmen" wird f&#xfc;r Wechseldatentr&#xe4;ger empfohlen.
Sie integriert sich nicht in Ihr System. Falls Sie Programmverkn&#xfc;pfungen
zu JonDoFox ben&#xf6;tigen, m&#xfc;ssen Sie diese bei der Version "zum
Mitnehmen" selber anlegen.</p>

<h4>Windows (2000, XP, Vista)</h4>

<p>Das <a
href="https://anonymous-proxy-servers.net/downloads/JonDoFox.paf.exe">JonDoFox-Installationsprogramm</a>
ist auch f&#xfc;r die Installation "zum Mitnehmen" geeignet. Wenn Sie die
"f&uuml;r Unterwegs"-Option w&#xe4;hlen, k&#xf6;nnen Sie JonDoFox damit also sowohl auf
einem Wechseldatentr&#xe4;ger als auch auf Ihrer Festplatte einrichten. Eine
bereits auf Ihrem Rechner vorhandene Firefox- oder JonDoFox-Installation wird
davon nicht beeinflusst, sofern Sie JonDoFox nicht ins gleiche Verzeichnis
installieren und eine vorhandene Installation dadurch aktualisieren. Beim
Aktualisieren von fr&#xfc;heren JonDoFox-Versionen bleiben Ihre Lesezeichen
und die Zertifikatsdatenbank erhalten. JonDoFox "zum Mitnehmen" integriert sich automatisch in das <a
href="http://portableapps.com/">PortableApps</a>-Men&#xfc; f&#xfc;r das auch
viele <a href="http://portableapps.com/apps">andere Anwendungen erh&#xe4;ltlich
sind</a>.</p>

<h2>Bedienungsanleitung f&#xfc;r JonDoFox</h2>

<h3><a name="critical_addons" id="critical_addons">
Sicherheitskritische Firefox-Erweiterungen</a></h3>

<p>Im JonDoFox sind bereits alle f&uuml;r sicheres und spurenarmes Surfen
relevanten Erweiterungen mit optimalen Voreinstellungen vorhanden. &#xdc;ber die Symbole <img alt="Statuszeile JonDoFox (Cookie Monster, NoScript, Adblock Plus, JonDoFox)"
src="img_jondofox/jondofox_statusbar.png"> in der Firefox-Statusleiste (bzw. das NoScript-Symbol <img alt="NoScript symbol toolbar" src="img_jondofox/noscript_toolbar.png"> in der Toolleiste (gilt n&uuml;r Firefox 4, in Firefox 3 ist das Icon mit in der Statusleiste)) haben Sie stets die
Kontrolle &#xfc;ber die wichtigsten der in JonDoFox integrierten Funktionen (Cookie Monster, Adblock Plus, NoScript und JonDoFox), die im Folgenden genauer erl&auml;utert werden:</p>

<h3><a name="jdf_features" id="jdf_features">
JonDoFox Features</a></h3>

<p>Im Folgenden werden die Hauptfeatures unserer JonDoFox-Erweiterung n&auml;her
erl&auml;utert, die ein sichereres und anonymes Surfen im Internet erm&ouml;glichen.</p>

<h4><a name="switchProxies" id="switchProxies">Flexibel bleiben und Proxies wechseln</a></h4>

<p>Wenn Sie mit einem anderen (lokalen) Proxy als JonDo oder ganz
ohne Proxy im Web surfen wollen, benutzen Sie einfach die in JonDoFox (rechts
unten) integrierte Schaltfl&#xe4;che <img alt="JonDo-Proxy"
src="img_jondofox/jondofox_jondo.png">, um zwischen verschiedenen
Proxy-Konfigurationen bequem hin- und herzuschalten: </p>

<div align="center">
<img alt="JonDoFox-Popup" src="img_jondofox/jondofox_popup.png" vspace="8" hspace="0" alt="JonDoFox Popup-Men&uuml;">
</div>
<ul>
  <li><b>Kein Proxy</b>: Wenn kein Proxy eingestellt ist, verbindet sich
    JonDoFox direkt zum Internet. <strong>Achtung: Ihre IP-Adresse wird
    dadurch im Klartext geschickt und nicht verschleiert!</strong></li>
  <li><b>Benutzerdefiniert</b>: Mithilfe dieser Einstellung k&#xf6;nnen Sie
    Ihre eigene Proxydefinition aktivieren. &#xdc;ber den Men&#xfc;punkt <span
    class="nowrap"><img src="img_jondofox/servermanuell.gif"
    alt="NoScript: nicht vertrauensw&#xfc;rdig"> <b>Einstellungen</b></span>
    k&#xf6;nnen Sie eine solche individuelle Proxykonfiguration erstellen. Dies
    wird aber nur Experten empfohlen.</li>
  <li><b>Tor</b>: Wenn Sie das Programm <a
    href="https://www.torproject.org">Tor</a> installiert und
    gestartet haben, k&#xf6;nnen Sie es mithilfe dieser Einstellung als
    Alternative zu JonDo verwenden.</li>
  <li><b>JonDo</b>: Bei dieser Einstellung schickt JonDoFox die
    Kommunikationsdaten des Browsers &#xfc;ber JonDo. JonDo muss dazu separat
    <a href="http://www.anonym-surfen.de/jondo.html">installiert und gestartet</a>
    sein.</li>
</ul>

<p>Wenn Sie eine Datei am Proxy vorbei herunterladen m&#xf6;chten, ohne den
Proxy dabei zu deaktivieren (z.B. um bei gro&#xdf;en Downloads Kosten oder Zeit
zu sparen), &#xf6;ffnen Sie dazu einfach das Kontextmen&#xfc; mit einem rechten
Mausklick auf die Datei und w&#xe4;hlen Sie <em>JonDo/Tor/Proxy umgehen und
Ziel speichern unter...</em>.</p>

<h4><a name="referer" id="referer">Referer-Management</a></h4>

<p>Der Referer ist eines der Merkmale, mit dessen Hilfe sich Nutzer beim Surfen 
unterscheiden lassen. Das kann allerdings verhindert werden, indem man unser 
Referer-Management aktiviert:</p>

<div align="center">
<img alt="Referer-Management" src="img_jondofox/referer_management_de.png" vspace="8" hspace="0">
</div>

<p>Dabei wird der Referer nicht einfach gel&ouml;scht, schlie&szlig;lich 
lassen sich einige Webangebote ohne einen mitgeschickten Referer &uuml;berhaupt
nicht benutzen. Vielmehr wird je nach Kontext des Seitenaufrufs ein Referer 
gesetzt (z.B. bei Weiterleitungen innerhalb derselben Domain) oder leer 
&uuml;bergeben (z.B. beim Laden von Lesezeichen). Damit wird garantiert,
dass aus dem Referer keine Informationen zur Nutzeridentifizierung gewonnen 
werden k&ouml;nnen.
</p>

<h4><a name="User Agent" id="User Agent">User Agent-Management</a></h4>
<p>Nicht nur &uuml;ber den Referer, sodern auch &uuml;ber den individuellen
User Agent, den der Browser bei Webanfragen mitsendet, lassen sich 
Nutzerinformationen gewinnen. Daher haben wir einen einheitlichen User Agent 
zusammengestellt, den alle JonDo-Nutzer mitschicken, wenn sie Anfragen an
das WWW stellen. Wenn hingegen Tor als Proxy eingestellt wird, so wird der User 
Agent an die Vorgaben von <a href="http://www.torproject.org/torbutton/">
Torbutton</a> angepasst. Wer seinen Proxy manuell konfigurieren m&ouml;chte, 
hat die M&ouml;glichkeit, zwischen verschiedenen User Agents zu w&auml;hlen:</p>

<div align="center">
<img alt="User Agent-Management" src="img_jondofox/user_agent_management_de.png" vspace="8" hspace="0">
</div>

<h4><a name="SafeCache" id="SafeCache">Schutz vor Cacheangriffen</a></h4>
<p>Neben dem Versuch, aus dem Referer, dem User Agent und anderen HTTP Headern
Informationen &uuml;ber den Nutzer zu gewinnen, gibt es noch die 
M&ouml;glichkeit, den Cache des Browsers f&uuml;r Angriffe zu verwenden. Dabei 
wird versucht, die k&uuml;rzere Ladezeit von Webseiten aus dem Cache auszunutzen
 oder sogenannte Cache-Cookies zu installieren. Zum besseren Schutz vor diesen 
Angriffen wurde der Code der SafeCache-Extension mit leichten Modifikationen
 in unsere Erweiterung integriert. Im JonDoFox-Einstellungsmen&uuml; findet sich ein entsprechender Hinweis darauf:</p>

<div align="center">
<img alt="Einstellungen Header" src="img_jondofox/settings_header_de.png" vspace="8" hspace="0">
</div>

<p align="center">...</p>

<div align="center">
<img alt="SafeCache" src="img_jondofox/safecache_de.png" vspace="8" hspace="0">
</div>

<h4><a name="Certificate Patrol" id="Certificate Patrol">Verbesserter Schutz 
vor gef&auml;lschten SSL-Zertifikaten</a></h4>
<p>F&uuml;r einen besseren Schutz vor gef&auml;lschten SSL-Zertifikaten wurde 
die Funktionalit&auml;t der Certificate Patrol-Extension etwas erweitert und in 
die JonDoFox-Extension aufgenommen (siehe JonDoFox' Einstellungsmen&uuml;):</p> 

<div align="center">
<img alt="Einstellungen Header" src="img_jondofox/settings_header_de.png" vspace="8" hspace="0">
</div>

<p align="center">...</p>

<div align="center">
<img alt="Certificate Patrol" src="img_jondofox/certpatrol_de.png" vspace="8" hspace="0">
</div>

<p>Dadurch wird es f&uuml;r den Nutzer zum einen sehr komfortabel, die
Fingerabdr&uuml;cke der Zertifikate zu &uuml;berpr&uuml;fen. Zum anderen wird 
bei Zertifikats&auml;nderungen ein Dialog eingeblendet, der den Nutzer auf 
eventuell vorhandene Unregelm&auml;&szlig;igkeiten hinweist und so besser vor
<a href="http://de.wikipedia.org/wiki/Man-in-the-middle-Angriff">Man-in-the-middle-Angriffen</a>
sch&uuml;tzt.</p>

<h4><a name="Temporary E-mail addresses" id="Temporary E-mail addresses">Tempor&auml;re E-Mail-Adressen benutzen</a></h4>
<p>Mit dem JonDoFox haben Sie die M&ouml;glichkeit, bequem tempor&auml;re E-Mail-Adressen zu benutzen. Klicken Sie dazu mit der rechten Maustaste auf ein Textfeld, in dem die E-Mail-Adresse erscheinen soll und w&auml;hlen Sie aus dem aufklappenden Men&uuml; folgenden Eintrag aus:</p> 

<div align="center">
<img alt="Tempor&auml;re E-Mail-Adressen -- Kontextmen&uuml;" src="img_jondofox/temp_emails_context_de.png" vspace="8" hspace="0">
</div>

<p>Danach wird die angeforderte E-Mail-Adresse in das Textfeld eingef&uuml;gt und Ihr Account in einem neuen Tab ge&ouml;ffnet. Wenn Sie selbst bestimmen m&ouml;chten, welchen Anbieter tempor&auml;rer E-Mail-Adressen Sie verwenden wollen, dann k&ouml;nnen Sie die entsprechenden Anpassungen in dem JonDoFox-Einstellungsmen&uuml; vornehmen:</p>

<div align="center">
<img alt="Tempor&auml;re E-Mail-Adressen -- Einstellungen" src="img_jondofox/temp_emails_de.png" vspace="8" hspace="0">
</div>

<h4><a name="Searchbar Privacy" id="Searchbar Privacy">Schutz der Suchanfragen vor Beoachtern am Rechner-Arbeitsplatz</a></h4>
<p>Um die Eingaben in die Suchleiste des Browsers vor ungewollten Beobachtern zu sch&uuml;tzen, entfernt JonDoFox diese nach jeder Eingabe. Au&szlig;erdem wird die Suchhistorie, in der die eingegebenen Begriffe gespeichert werden, jede halbe Stunde gel&ouml;scht. Damit kann es zum einen nicht mehr passieren, dass die letzte Suchanfrage f&uuml;r jeden, der Zugang zur Browsersitzung des Nutzers hat, einsehbar bleibt. Zum anderen wird die M&ouml;glichkeit, dass Eintr&auml;ge in der Suchistorie den Nutzer kompromittieren, minimiert, ohne deren Funktionalit&auml;t ganz aufzugeben.</p>

<h3><a name="controlCookies" id="controlCookies">Cookies kontrollieren mit Cookie Monster</a> </h3>

<p>Mittels <em>Cookie Monster</em> k&#xf6;nnen Sie sehr komfortabel bestimmen, von welchen
Webseiten Sie Cookies annehmen und bei welchen Sie Cookies unterbinden wollen.
Wenn Sie mit der linken Maustaste auf das <span class="nowrap">Icon <img
  src="img_jondofox/cookie-monster-logo.png" alt="Cookie Monster Icon"></span> von <em>Cookie Monster</em> klicken,
k&#xf6;nnen Sie im unteren Teil des Men&uuml;s folgende Freigaben f&#xfc;r die jeweils besuchte Webseite vornehmen: </p>

<div style="text-align:center">
<img src="img_jondofox/cookieMonster_menu_de.png" alt="Cookie Monster Men&#xfc;" vspace="8" hspace="0"> </div>
<ul>
  <li> <b>Erlaube Cookies tempor&auml;r von anonymous-proxy-servers.net</b><br>
    Das Cookie wird nur f&#xfc;r die momentane Browsersitzung akzeptiert und
    danach gel&#xf6;scht. Nach einem Neustart des Browsers hat die Webseite
    keine Berechtigung mehr, ein Cookie auszulesen oder zu setzen. <strong>Dies
    ist die empfohlene Einstellung, falls Sie Cookies aktivieren
    m&#xf6;chten.</strong> Bei erfolgreicher Auswahl dieser Option erscheint
  das <span class="nowrap">Icon <img src="img_jondofox/face-angel-temp.png"></span> in der Statuszeile.</li>
  <li><b>Erlaube Cookies von anonymous-proxy-servers.net</b><br>
    Das Cookie wird solange im Browser gespeichert, wie es von der Webseite
    vorgegeben wird. Es kann auch nach dem Neustart des Browsers erhalten
    bleiben und von der Webseite angefordert werden. Das Symbol f&uuml;r dieses
    Cookieverhalten ist das <span class="nowrap">Icon <img src="img_jondofox/face-angel.png"></span>, was bei erfolgreicher Auswahl dieser Option wiederum
    in der Statusleiste erscheint. </li> 
  <li><b>Verweigere Cookies von anonymous-proxy-servers.net</b><br>
    Cookies k&ouml;nnen nun weder von der Webseite ausgelesen noch von ihr 
    gesetzt werden. Bei erfolgreicher Auswahl dieser Option erscheint das <span     class="nowrap">Icon <img src="img_jondofox/face-devil-grin.png"></span> in der Statuszeile. </li> 
  <li><b>Erlaube Sitzungscookies von anonymous-proxy-servers.net</b><br>
    Das Cookie wird nur f&#xfc;r die momentane Browsersitzung akzeptiert und
    danach gel&#xf6;scht. Die Webseite darf in Zukunft nach dem Neustart des Browsers
    wieder neue Cookie setzen. Diese Option k&ouml;nnen Sie f&uuml;r
    h&auml;ufig besuchte, vertrauensw&uuml;rdige Websites nutzen, die nur
    mit Cookies benutzbar sind. Bei erfolgreicher Auswahl dieser Cookieeinstellung erscheint das <span class="nowrap">Icon <img src="img_jondofox/face-glasses.png"></span> in der Statuszeile.</li>
</ul>

<h3><a name="noscript" id="noscript">Kontrolle von JavaScript mit NoScript</a></h3>

<p>Wenn Sie auf das <span class="nowrap">NoScript-Icon <img
src="img_jondofox/noscript.gif" alt="NoScript-Icon"></span> klicken, erhalten
Sie eine Auflistung der Adressen/Dienstanbieter mit JavaScript-Codes auf der
gerade besuchten Webseite. Die entsprechenden Eintr&#xe4;ge sind durch das
<span class="nowrap">Icon <img src="img_jondofox/noscript_temp.gif"
alt="NoScript tempor&#xe4;r erlauben"></span> gekennzeichnet. Neben der betrachteten Websites
werden h&auml;ufig auch Scripte von Subdomains ben&ouml;tig, um die volle Funktion zu ereichen.
Welche Subdomains freigegeben werden m&uuml;ssen, kann nur durch probieren ermittelt werden.</p>

<p><strong>Hinweis:</strong> Skripte von Drittanbietern bzw. anderen Adressen werden
&#xfc;blicherweise nur dazu verwendet, um Sie auszuspionieren, und sind
f&#xfc;r die Funktionalit&#xe4;t der Webseite selten notwendig.</p>

<div align="center">
<img src="img_jondofox/noscript_allow.png" alt="NoScript: Erlaubnis erteilen" vspace="8" hspace="0">
</div>

<p>Durch einen Klick auf <span><img src="img_jondofox/noscript_temp.gif"
alt="NoScript tempor&#xe4;r erlauben"> <b>tempor&#xe4;r erlauben</b></span>
aktivieren Sie die Skripte f&#xfc;r diesen Eintrag. Mit einem weiteren Klick
k&#xf6;nnen Sie eine bereits
erteilte Berechtigung wieder entziehen (siehe n&auml;chste Grafik). Wenn Sie allen Adressen die
tempor&#xe4;ren Berechtigungen entziehen wollen, k&#xf6;nnen Sie dies, indem Sie
auf den Eintrag <span><img src="img_jondofox/noscript_disallowall.gif"
alt="NoScript: Tempor&#xe4;re Berechtigungen aufheben"><b>Tempor&#xe4;re
Berechtigungen aufheben</b></span> klicken.</p>

<div align="center">
<img src="img_jondofox/noscript_disallow.png" alt="NoScript: Erlaubnis entziehen" vspace="8" hspace="0">
</div>

<p>F&uuml;r Websites die sie h&auml;ufig besuchen, k&ouml;nnen sie die Einstellungen mit
einem Klick auf den Men&uuml;punkt <b>Berechtigungen dieser Seite speichern</b>
dauerhauft festlegen. Dann muss man nicht bei jedem Besuch die Freiaben wieder 
neu einrichten.</p>

<p>Sollten Sie einer Adresse grunds&#xe4;tzlich nicht vertrauen, k&#xf6;nnen
Sie diese als <i>nicht vertrauensw&#xfc;rdig</i> einstufen, und sie wird
anschlie&#xdf;end nicht mehr unter den Adressen auftauchen, die sie zulassen
k&#xf6;nnen. Um diese Einstufung durchzuf&#xfc;hren, fahren Sie mit der Maus
&#xfc;ber <span class="nowrap"><img src="img_jondofox/noscript_untrwicon.gif"
alt="NoScript: nicht vertrauensw&#xfc;rdig"> <b>Nicht
vertrauensw&#xfc;rdig</b>.</span> Sie erhalten dann die &#xdc;bersicht der
Adressen auf der gerade besuchten Webseite, denen Sie das Vertrauen entziehen
k&#xf6;nnen: </p>

<div align="center">
<img src="img_jondofox/noscript_untrustw.png"
alt="NoScript: nicht vertrauensw&#xfc;rdig Men&#xfc;"> </div>

<p>Die Aktion kann auf die gleiche Weise wieder r&#xfc;ckg&#xe4;ngig gemacht
werden. </p>

<h3><a name="noscript_ssl" id="noscript_ssl">SSL erwzingen mit NoScript</a></h3>
<p>Es gibt vielleicht Webseiten, die man allein &uuml;ber eine mit SSL gesicherte Verbindung ansurfen m&ouml;chte (das beinhaltet auch die eingebetteten Bilder, Stylesheets etc.). NoScript gibt Ihnen die M&ouml;glichkeit, SSL f&uuml;r Verbindungen zu erzwingen. 
Klicken Sie dazu mit der rechten Maustaste auf das NoScript-Symbol <img src="img_jondofox/noscript.gif" alt="NoScript-Icon">. Unter <i>Einstellungen -&gt; Erweitert -&gt; HTTPS -&gt; Verhalten</i> bietet NoScript mittels einer Whitelist genau diese Option an, wie man im folgenden Bildschirmfoto sehen kann. Es ist dabei m&ouml;glich, sowohl einzelne Domains in die Whitelist einzutragen, als auch mit Hilfe des Wildcard-Zeichens ("*") SSL f&uuml;r ganze Subdomains zu erzwingen.</p> 

<div align="left">
  <img src="img_jondofox/noscript_STS_de.png" alt="NoScript_STS" vspace="8" hspace="0">
</div>

<p>Eine eigene Whitelist k&ouml;nnen Sie sich mit Hilfe der <a href="https://anonymous-proxy-servers.net/wiki/index.php/Sicherheitshinweise#HTTPS-Verschl.C3.BCsselung_erzwingen">erweiterbaren Sammlung von HTTPS Domains</a> im Wiki zusammenstellen.
Andere Erweiterungen enthalten eine vordefinierte Liste, z.B. <a href="http://www.eff.org/https-everywhere">HTTPS-Everywhere</a>.

<h3><a name="noscript_plugin" id="noscript_plugin">Kontrolle der installierten Plugins</a></h3>

<p>Wenn Sie eine Webseite besuchen, die Plugin-Inhalte, wie Flash-Movies oder
Java-Applets, enth&auml;lt, werden diese von NoScript grunds&auml;tzlich
blockiert. Anstelle des aktiven Inhalts erscheint ein NoScript-Platzhalter: </p>

<div align="left">
<img src="img_jondofox/noscript_placeholder.gif" alt="NoScript-Platzhalter" vspace="8" hspace="0">
</div>    

<p>Sie k&#xf6;nnen den jeweiligen Inhalt durch einen Klick auf den Platzhalter
oder &#xfc;ber die Auswahl <span><img
src="img_jondofox/noscript_blockedcontent.gif"
alt="NoScript: Geblockte Objekte"> <b>Geblockte Objekte</b></span> im
NoScript-Men&#xfc; <img src="img_jondofox/noscript.gif" alt="NoScript-Icon">
freigeben. </p>

<p><strong>Warnung:</strong> Ohne <a
href="https://anonymous-proxy-servers.net/de/help/flash-applets.html">spezielle
Schutzma&#xdf;nahmen</a> kann &#xfc;ber freigegebene Plugin-Inhalte Ihre
Anonymit&#xe4;t aufgehoben und sogar Ihr System besch&#xe4;digt werden.</p>


<h3><a name="videoDownload" id="videoDownload">Schutz gegen gef&#xe4;hrliche
Flash-Videos: Video-Download mit UnPlug</a></h3>

<p>Um nicht das sehr gef&#xe4;hrliche Flash im Browser aktivieren zu
m&#xfc;ssen, sollten Sie Web-Videos immer auf Ihre Festplatte herunterladen und
von dort abspielen. Dies erspart Ihnen au&#xdf;erdem den zus&#xe4;tzlichen
Download-Datenverkehr, wenn Sie ein Video mehrmals betrachten m&#xf6;chten.
JonDoFox enth&#xe4;lt dazu das
Download-Tool <em>UnPlug</em>. Wenn Sie z.B. auf einer YouTube-Seite sind,
klicken Sie einfach auf den entsprechenden Men&uuml;eintrag (rot markiert)  in Ihrem <em>Extras</em>-Men&uuml; und w&#xe4;hlen Sie das Video aus, das Sie herunterladen m&#xf6;chten:</p>

<div align="center"><img alt="1-Klick-Video-Download mit UnPlug"
src="img_jondofox/UnPlug_de.png" vspace="10"></div>

<p>F&#xfc;r Windows gibt es au&#xdf;erdem ein
hervorragendes Freeware-Programm namens <a
href="http://atube-catcher.dsnetwb.com">aTube Catcher</a> speziell f&uuml;r den Video Download. Die Konfiguration des
Programms f&uuml;r anonyme Downloads ist <a href="https://anonymous-proxy-servers.net/wiki/index.php/Kompatible_Anwendungen#Video_Downloads_mit_aTube_Catcher">im Wiki beschrieben</a>.</p>

<h3><a name="filterAds" id="filterAds">Werbung filtern mit
Adblock Plus</a></h3>

<p>Adblock Plus <img alt="Adblock Plus" src="img_jondofox/abp-enabled-16.png">
arbeitet als Werbefilter im Hintergrund. Normalerweise m&#xfc;ssen Sie dessen
Einstellungen nicht ver&#xe4;ndern, k&#xf6;nnen aber jederzeit eigene
Filterlisten erg&#xe4;nzen.</p>
<hr>

</body>
</html>
